Tekla Open API Reference for Tekla Structures 2025
SizeDefinitionMode Enumeration
 Controls the size definition mode of the drawing sheet. Set the mode to SizeDefinitionMode.SpecifiedSize if you want to force the sheet to a certain size.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SizeDefinitionMode
Public Enumeration SizeDefinitionMode
Members
Member name | Value | Description
AutoSize | 0 | The smallest possible drawing sheet is automatically calculated.
SpecifiedSize | 1 | Fixed values are used to control the sheet size.
See Also
Reference
Tekla.Structures.Drawing Namespace
Tekla.Structures.Drawing.LayoutAttributes